src/InformationRegisters/ЗамерыПроизводительности/ЗамерыПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПроизводительности</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ПользователиЗамерПроизводительности</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗамераUTC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлючевойОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗамерыПроизводительностиДополнительнаяИнформация/ЗамерыПроизводительностиДополнительнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамерыПроизводительностиДополнительнаяИнформация</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ЗначенияПараметраЗамера</types>
    </type>
  </resources>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <comment>Уникальный идентификатор записи в регистре сведений ЗамерыПроизводительности</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрыЗамера</name>
    <type>
      <types>CatalogRef.ПараметрыЗамера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ВнутренниеЗамеры/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НачатьЗамер(ИмяКлючевойОперации) Экспорт
    Возврат ВнутренниеЗамерыКлиентСервер.НовыйЗамер(ТекущаяУниверсальнаяДатаВМиллисекундах(), ИмяКлючевойОперации, Ложь);
КонецФункции

Процедура ЗавершитьЗамер(Замер, ДопПараметры = Неопределено) Экспорт
    
    Замер["ДатаОкончания"] = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
	УстановитьПривилегированныйРежим(Истина);
    
    ПараметрыЗаписиПроизводительности = ОбщийСерверПовтИсп.ПолучитьПараметрыЗаписиПроизводительности(Замер["ИмяКлючевойОперации"], 1);
    ПользовательЗамераПроизводительности = ОбщийСерверПовтИсп.ПолучитьПользователяЗамераПроизводительности(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
    
    Если НЕ ПараметрыЗаписиПроизводительности.ПомеченаНаУдаление Тогда
        
        УникальныйИдентификаторЗаписи = Новый УникальныйИдентификатор();
        
        НовЗапись = РегистрыСведений.ЗамерыПроизводительности.СоздатьМенеджерЗаписи();
        НовЗапись.ОбъектКонтроля = ПараметрыЗаписиПроизводительности.ОбъектКонтроля;
        НовЗапись.ДатаЗамераUTC = Замер["ДатаНачала"];
        НовЗапись.ИдентификаторКлючевойОперации = ПараметрыЗаписиПроизводительности.УникальныйИдентификаторКлючевойОперации;
        НовЗапись.НомерСеанса = НомерСеансаИнформационнойБазы();
        НовЗапись.Значение = (Замер["ДатаОкончания"] - Замер["ДатаНачала"])/1000;
        НовЗапись.ДатаЗаписи = ТекущаяДата();
        НовЗапись.Пользователь = ПользовательЗамераПроизводительности;
        НовЗапись.УникальныйИдентификаторЗаписи = УникальныйИдентификаторЗаписи; 
        НовЗапись.Записать(Ложь);
        
        Если ДопПараметры <> Неопределено Тогда
            
            НаборЗаписей = РегистрыСведений.ЗамерыПроизводительностиДополнительнаяИнформация.СоздатьНаборЗаписей();
            
            Для Каждого ТекПараметр Из ДопПараметры Цикл
                
                ПараметрЗамера = ОбщийСерверПовтИсп.ПолучитьПараметрЗамераПоНаименованию(ТекПараметр.Ключ);
                ЗначениеПараметра = ОбщийСерверПовтИсп.ПолучитьЗначениеПараметраЗамераПоНаименованию(ТекПараметр.Значение, ПараметрЗамера);
                
                НовЗаписьДопИнфо = НаборЗаписей.Добавить();
                НовЗаписьДопИнфо.УникальныйИдентификаторЗаписи = УникальныйИдентификаторЗаписи;
                НовЗаписьДопИнфо.ПараметрыЗамера = ПараметрЗамера;
                НовЗаписьДопИнфо.Значение = ЗначениеПараметра;
                
            КонецЦикла;
            
            НаборЗаписей.Записать(Ложь);
            
        КонецЕсли;
    КонецЕсли;
    	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура УстановитьИмяКлючевойОперации(Замер, ИмяКлючевойОперации) Экспорт
    Замер["ИмяКлючевойОперации"] = ИмяКлючевойОперации;
КонецПроцедуры

#КонецОбласти
